In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(data=[[2,4,6,-1],[3,-4,2,-1],[-10,3,5,-7]], columns=["c1","c2","c3","c4"], index = ["r1","r2","r3"])

In [3]:
df

    c1  c2  c3  c4
r1   2   4   6  -1
r2   3  -4   2  -1
r3 -10   3   5  -7

In [4]:
df.head(2) #display the no.of given rows

    c1  c2  c3  c4
r1   2   4   6  -1
r2   3  -4   2  -1

In [5]:
#Adding a column

df["NewC"] = 7

df

    c1  c2  c3  c4  NewC
r1   2   4   6  -1     7
r2   3  -4   2  -1     7
r3 -10   3   5  -7     7

In [6]:
df["add"] = df["NewC"] + df["c4"]

In [7]:
df

    c1  c2  c3  c4  NewC  add
r1   2   4   6  -1     7    6
r2   3  -4   2  -1     7    6
r3 -10   3   5  -7     7    0

In [8]:
#Deleting a column

df.drop("NewC", axis=1,inplace = True) 

#Just mentioning column name wont be recognised by panda. 
#If we want to delete row(axis = 0) and column(axis = 1)
#inplace = true makes modification in the original dataframe

df

    c1  c2  c3  c4  add
r1   2   4   6  -1    6
r2   3  -4   2  -1    6
r3 -10   3   5  -7    0

## Select, .loc, .iloc

In [9]:
df

    c1  c2  c3  c4  add
r1   2   4   6  -1    6
r2   3  -4   2  -1    6
r3 -10   3   5  -7    0

In [10]:
df[['c2','c4']]

    c2  c4
r1   4  -1
r2  -4  -1
r3   3  -7

----
### .loc, .iloc
-  .loc(rows,columns) select rows,columns by name
-  .iloc(rows,columns) select rows, columns by integer(index)

In [11]:
df

    c1  c2  c3  c4  add
r1   2   4   6  -1    6
r2   3  -4   2  -1    6
r3 -10   3   5  -7    0

In [12]:
df.loc[["r1","r2"],["c2","c3"]]

    c2  c3
r1   4   6
r2  -4   2

In [13]:
df.loc["r2":,"c3"] #r2,r3 value with corresponding to c3

r2    2
r3    5
Name: c3, dtype: int64

In [14]:
df.loc[:,"c2":] #All rows values for columns c2..c4

    c2  c3  c4  add
r1   4   6  -1    6
r2  -4   2  -1    6
r3   3   5  -7    0

In [15]:
df.loc[:,:"c2"]

    c1  c2
r1   2   4
r2   3  -4
r3 -10   3

In [16]:
df

    c1  c2  c3  c4  add
r1   2   4   6  -1    6
r2   3  -4   2  -1    6
r3 -10   3   5  -7    0

In [22]:
df.loc["r2","c2":"c3"]

c2   -4
c3    2
Name: r2, dtype: int64

In [23]:
df

    c1  c2  c3  c4  add
r1   2   4   6  -1    6
r2   3  -4   2  -1    6
r3 -10   3   5  -7    0

In [24]:
df.iloc[1:3,1:3] # .iloc uses index numbers for slicing

    c2  c3
r2  -4   2
r3   3   5

In [25]:
df.iloc[2:,:3]

    c1  c2  c3
r3 -10   3   5